[
  {
    "image": "https://i.ibb.co.com/3Yk7y5wQ/image.png",
    "title": "WhatsApp",
    "companyName": "Meta Platforms",
    "id": 1,
    "description": "Chat, voice & video calls. WhatsApp is one of the most popular messaging apps that allows users to communicate instantly across the world. It provides end-to-end encryption for all messages, ensuring your privacy and security. Users can share photos, videos, documents, and even live locations with friends and family. The app also supports group chats for up to thousands of participants. WhatsApp Web enables messaging directly from your computer browser. With WhatsApp Business, companies can interact professionally with customers. Frequent updates improve security, usability, and media quality.",
    "size": 60.0,
    "reviews": "50K",
    "ratingAvg": 4.5,
    "downloads": "5M",
    "ratings": [
      { "name": "5 star", "count": 33000000 },
      { "name": "4 star", "count": 15000000 },
      { "name": "3 star", "count": 2000000 },
      { "name": "2 star", "count": 500000 },
      { "name": "1 star", "count": 800000 }
    ]
  },
  {
    "image": "https://media.wired.com/photos/5926ffe47034dc5f91bed4e8/master/pass/google-logo.jpg",
    "title": "Google",
    "companyName": "Google LLC",
    "id": 2,
    "description": "Search, services & more. Google is the world’s most widely used search engine, offering instant access to millions of results on any topic. It also integrates with various services like Gmail, Drive, Maps, Photos, and YouTube. The company focuses on providing fast, relevant, and personalized results to each user. Google Assistant offers hands-free voice search and smart device control. Its cloud and AI technologies help developers and businesses achieve efficiency. Google constantly innovates to make knowledge more accessible and organized for everyone worldwide.",
    "size": 50.0,
    "reviews": "20K",
    "ratingAvg": 4.6,
    "downloads": "4M",
    "ratings": [
      { "name": "5 star", "count": 14200000 },
      { "name": "4 star", "count": 5000000 },
      { "name": "3 star", "count": 800000 },
      { "name": "2 star", "count": 200000 },
      { "name": "1 star", "count": 300000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/tw7wLH85/ins.png",
    "title": "Instagram",
    "companyName": "Meta Platforms",
    "id": 3,
    "description": "Photo & video sharing social network. Instagram allows users to share moments through pictures, reels, and stories. It connects people through creativity and lifestyle expression. The app offers filters, editing tools, and hashtags to enhance visibility. Users can explore trends through the Explore tab and follow favorite creators. Instagram also supports business profiles, insights, and advertising options for brands. With messaging and live video features, it enhances interaction and engagement. The platform regularly adds new features to improve user experience and creativity.",
    "size": 45.0,
    "reviews": "25M",
    "ratingAvg": 4.4,
    "downloads": "2K",
    "ratings": [
      { "name": "5 star", "count": 16800000 },
      { "name": "4 star", "count": 7000000 },
      { "name": "3 star", "count": 1000000 },
      { "name": "2 star", "count": 300000 },
      { "name": "1 star", "count": 400000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/sdTLYmLP/image.png",
    "title": "Twitter",
    "companyName": "X Corp (formerly Twitter)",
    "id": 4,
    "description": "Microblogging & social networking. Twitter, now known as X, is a fast-paced platform where users share short messages called posts. It’s a space for real-time updates, trending news, and public conversations. Users can follow topics, hashtags, and influencers worldwide. The platform encourages freedom of expression and global dialogue. It supports multimedia posts with images, GIFs, and videos. With the introduction of X Premium, advanced features like longer posts and monetization became available. The platform continues to evolve toward a digital media ecosystem.",
    "size": 30.0,
    "reviews": "18K",
    "ratingAvg": 4.2,
    "downloads": "1.5M",
    "ratings": [
      { "name": "5 star", "count": 11000000 },
      { "name": "4 star", "count": 5000000 },
      { "name": "3 star", "count": 1200000 },
      { "name": "2 star", "count": 300000 },
      { "name": "1 star", "count": 500000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/zT23Jss6/image.png",
    "title": "Facebook",
    "companyName": "Meta Platforms",
    "id": 5,
    "description": "Social network, posts, groups, pages. Facebook connects billions of users globally for sharing posts, photos, and life updates. It enables people to create pages, groups, and events to interact with communities. Businesses can promote products and run ads to reach target audiences. Facebook Live and Stories enhance personal engagement and creativity. It also integrates messaging via Messenger and marketplace for local buying and selling. With continuous updates, Facebook focuses on user safety and data protection. Its influence on communication and marketing remains unmatched worldwide.",
    "size": 55.0,
    "reviews": "30K",
    "ratingAvg": 4.3,
    "downloads": "788M",
    "ratings": [
      { "name": "5 star", "count": 20900000 },
      { "name": "4 star", "count": 8000000 },
      { "name": "3 star", "count": 1500000 },
      { "name": "2 star", "count": 400000 },
      { "name": "1 star", "count": 600000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/vyVmpfV/youtube-app-icon-hd.webp",
    "title": "YouTube",
    "companyName": "Google LLC",
    "id": 6,
    "description": "Video sharing & streaming platform. YouTube is the largest video platform where users can watch, upload, and share videos for free. It supports entertainment, education, music, and live streaming. Creators can monetize their channels through ads and memberships. Users can subscribe to channels and receive notifications for new uploads. YouTube Premium offers ad-free viewing and offline downloads. The platform’s recommendation system personalizes content for every user. With Shorts and Community features, YouTube promotes creative freedom and global communication.",
    "size": 60.0,
    "reviews": "22K",
    "ratingAvg": 4.7,
    "downloads": "805M",
    "ratings": [
      { "name": "5 star", "count": 14700000 },
      { "name": "4 star", "count": 6000000 },
      { "name": "3 star", "count": 1500000 },
      { "name": "2 star", "count": 350000 },
      { "name": "1 star", "count": 500000 }
    ]
  },
  {
    "image": "https://media.designrush.com/inspirations/540509/conversions/apple-logo-design-preview.jpg",
    "title": "Apple",
    "companyName": "Apple Inc.",
    "id": 7,
    "description": "Technology & devices maker. Apple Inc. is one of the world’s most valuable technology companies, known for innovation and design excellence. It produces iconic products such as the iPhone, MacBook, iPad, and Apple Watch. The company’s software ecosystem includes macOS, iOS, and iCloud, ensuring seamless synchronization. Apple emphasizes user privacy, environmental sustainability, and quality craftsmanship. The App Store connects millions of developers with global users. Its services like Apple Music, TV+, and Arcade continue expanding its digital footprint. Apple remains a symbol of premium technology and creativity.",
    "size": 40.0,
    "reviews": "12K",
    "ratingAvg": 4.5,
    "downloads": "10M",
    "ratings": [
      { "name": "5 star", "count": 6500000 },
      { "name": "4 star", "count": 5000000 },
      { "name": "3 star", "count": 800000 },
      { "name": "2 star", "count": 200000 },
      { "name": "1 star", "count": 300000 }
    ]
  },
  {
    "image": "https://www.logo.wine/a/logo/Spotify/Spotify-Icon-Logo.wine.svg",
    "title": "Spotify",
    "companyName": "Spotify AB",
    "id": 8,
    "description": "Music streaming & podcasts. Spotify is the leading platform for streaming millions of songs and podcasts online. It allows users to explore music from every genre and artist worldwide. Personalized playlists and AI-based recommendations make the experience unique. The app supports offline downloads for premium users. Spotify also enables creators to share and monetize their podcasts. With social features, users can share playlists and follow friends’ activity. Its global reach and continuous innovation make it a favorite for music lovers. The interface is sleek, intuitive, and regularly updated for better usability.",
    "size": 35.0,
    "reviews": "16K",
    "ratingAvg": 4.4,
    "downloads": "22M",
    "ratings": [
      { "name": "5 star", "count": 9000000 },
      { "name": "4 star", "count": 6000000 },
      { "name": "3 star", "count": 1000000 },
      { "name": "2 star", "count": 300000 },
      { "name": "1 star", "count": 400000 }
    ]
  },
  {
    "image": "https://www.logo.wine/a/logo/Dropbox_(service)/Dropbox_(service)-Icon-Logo.wine.svg",
    "title": "Dropbox",
    "companyName": "Dropbox, Inc.",
    "id": 9,
    "description": "Cloud storage & file sharing. Dropbox is a secure cloud service that helps users store, sync, and share files across devices. It’s designed for individuals and teams to collaborate efficiently. With automatic backup and version control, files are always safe and accessible. Users can create shared folders and manage permissions for teammates. Integration with tools like Google Workspace, Slack, and Zoom improves workflow productivity. Dropbox Paper enhances document collaboration. The platform emphasizes reliability, simplicity, and enterprise-level security for users worldwide.",
    "size": 25.0,
    "reviews": "5K",
    "ratingAvg": 4.3,
    "downloads": "80M",
    "ratings": [
      { "name": "5 star", "count": 3100000 },
      { "name": "4 star", "count": 1500000 },
      { "name": "3 star", "count": 300000 },
      { "name": "2 star", "count": 100000 },
      { "name": "1 star", "count": 150000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/c/ca/LinkedIn_logo_initials.png",
    "title": "LinkedIn",
    "companyName": "LinkedIn Corporation",
    "id": 10,
    "description": "Professional networking. LinkedIn is the world’s largest professional platform that connects job seekers, recruiters, and companies. It allows users to build resumes, showcase skills, and network with professionals. Businesses use it for branding, hiring, and B2B marketing. LinkedIn Learning provides online courses for career growth. The news feed helps users stay updated with industry trends and insights. It supports messaging, endorsements, and recommendations to enhance credibility. LinkedIn continues to be a vital tool for modern career development and global opportunities.",
    "size": 20.0,
    "reviews": "7K",
    "ratingAvg": 4.2,
    "downloads": "11M",
    "ratings": [
      { "name": "5 star", "count": 4500000 },
      { "name": "4 star", "count": 2000000 },
      { "name": "3 star", "count": 400000 },
      { "name": "2 star", "count": 150000 },
      { "name": "1 star", "count": 200000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/nshWw9zL/image.png",
    "title": "TikTok",
    "companyName": "ByteDance",
    "id": 11,
    "description": "Short video platform. TikTok revolutionized social media with its short-form video format. Users can create and share entertaining clips with music, filters, and effects. The algorithm tailors a personalized feed based on user interests. It empowers creators to reach massive audiences worldwide. TikTok trends influence fashion, entertainment, and pop culture globally. It also offers live streaming, duets, and editing tools to enhance creativity. The platform encourages user expression while maintaining community guidelines. Its growth continues rapidly, appealing to younger generations everywhere.",
    "size": 28.0,
    "reviews": "14K",
    "ratingAvg": 4.4,
    "downloads": "3M",
    "ratings": [
      { "name": "5 star", "count": 8300000 },
      { "name": "4 star", "count": 5000000 },
      { "name": "3 star", "count": 800000 },
      { "name": "2 star", "count": 200000 },
      { "name": "1 star", "count": 300000 }
    ]
  },
  {
    "image": "https://download.logo.wine/logo/Telegram_(software)/Telegram_(software)-Logo.wine.png",
    "title": "Telegram",
    "companyName": "Telegram Messenger",
    "id": 12,
    "description": "Messaging with focus on speed & privacy. Telegram is a cloud-based messenger app emphasizing privacy and performance. It allows users to send texts, media, files, and voice notes securely. With channels and groups supporting thousands of members, it’s ideal for communities. Telegram bots automate tasks, improving interaction and productivity. Secret chats use end-to-end encryption for enhanced safety. The app syncs seamlessly across devices, storing all data in the cloud. Customization options, themes, and stickers make communication more engaging. It’s fast, secure, and ad-free—trusted by millions worldwide.",
    "size": 22.0,
    "reviews": "11K",
    "ratingAvg": 4.6,
    "downloads": "1M",
    "ratings": [
      { "name": "5 star", "count": 7500000 },
      { "name": "4 star", "count": 3000000 },
      { "name": "3 star", "count": 400000 },
      { "name": "2 star", "count": 120000 },
      { "name": "1 star", "count": 180000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/HLTxVCpJ/snapchat-vector-social-media-icon-459124-527.jpg",
    "title": "Snapchat",
    "companyName": "Snap Inc.",
    "id": 13,
    "description": "Multimedia messaging app. Snapchat allows users to send photos and videos that disappear after being viewed. Create and share Stories to your friends and followers. Explore augmented reality lenses and filters for fun interactions. Chat via text, voice, and video seamlessly. Discover content from publishers and trending topics daily. Participate in Bitmoji integration for personalized avatars. Maintain privacy with disappearing messages and controlled sharing options. Engage in creative communication in a dynamic, youthful environment.",
    "size": 35.0,
    "reviews": "10K",
    "ratingAvg": 4.3,
    "downloads": "500M",
    "ratings": [
      { "name": "5 star", "count": 2500000 },
      { "name": "4 star", "count": 1200000 },
      { "name": "3 star", "count": 500000 },
      { "name": "2 star", "count": 200000 },
      { "name": "1 star", "count": 150000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/5W0jJZXK/reddit-logo-578229-207.jpg",
    "title": "Reddit",
    "companyName": "Reddit Inc.",
    "id": 14,
    "description": "Community discussion platform. Reddit is a social media and forum website with communities called subreddits. Users can post text, images, and links for discussion. Vote content up or down to determine visibility. Follow topics of interest from technology to entertainment. Participate in AMAs and live discussions. Engage in private chats and message users directly. Discover trending topics, news, and memes daily. The platform encourages knowledge sharing and diverse community interaction.",
    "size": 40.0,
    "reviews": "15K",
    "ratingAvg": 4.5,
    "downloads": "400M",
    "ratings": [
      { "name": "5 star", "count": 1800000 },
      { "name": "4 star", "count": 900000 },
      { "name": "3 star", "count": 400000 },
      { "name": "2 star", "count": 150000 },
      { "name": "1 star", "count": 100000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/9HHWcCGB/image.png",
    "title": "Byte",
    "companyName": "Byte, Inc.",
    "id": 15,
    "description": "Short looping video platform. Byte enables users to create 6-second looping videos easily. Share and explore creative, funny, or artistic clips. Follow creators and like, comment, or share their content. Discover trending loops and challenges. Use editing tools and audio integration for unique videos. Engage with a vibrant creative community. Build a personal profile showcasing your content. Perfect for bite-sized entertainment and creative expression.",
    "size": 25.0,
    "reviews": "8K",
    "ratingAvg": 4.2,
    "downloads": "50M",
    "ratings": [
      { "name": "5 star", "count": 1500000 },
      { "name": "4 star", "count": 700000 },
      { "name": "3 star", "count": 300000 },
      { "name": "2 star", "count": 100000 },
      { "name": "1 star", "count": 50000 }
    ]
  },
  {
    "image": "https://cdn.worldvectorlogo.com/logos/trello.svg",
    "title": "Trello",
    "companyName": "Atlassian",
    "id": 16,
    "description": "Project management tool. Trello helps organize tasks using boards, lists, and cards. Collaborate with team members in real-time. Assign tasks, set deadlines, and track progress visually. Use labels, checklists, and attachments for detailed management. Integrate with apps like Slack, Google Drive, and Jira. Access boards from mobile or desktop seamlessly. Automate workflows with Butler to save time. Trello is ideal for personal productivity, business projects, and collaborative planning.",
    "size": 30.0,
    "reviews": "12K",
    "ratingAvg": 4.6,
    "downloads": "100M",
    "ratings": [
      { "name": "5 star", "count": 5000000 },
      { "name": "4 star", "count": 2500000 },
      { "name": "3 star", "count": 600000 },
      { "name": "2 star", "count": 200000 },
      { "name": "1 star", "count": 100000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/4RvLdVck/image.png",
    "title": "Zoom",
    "companyName": "Zoom Video Communications",
    "id": 17,
    "description": "Video conferencing & webinars. Zoom allows virtual meetings, webinars, and video calls for businesses and individuals. Schedule meetings with easy links and passwords. Share screens, documents, and presentations seamlessly. Record sessions for later reference. Use breakout rooms for group discussions. Host large meetings with video and audio controls. Integrate with calendars, Slack, and other productivity tools. Zoom ensures smooth connectivity, security, and collaboration for remote work and online learning.",
    "size": 45.0,
    "reviews": "20K",
    "ratingAvg": 4.7,
    "downloads": "300M",
    "ratings": [
      { "name": "5 star", "count": 10000000 },
      { "name": "4 star", "count": 5000000 },
      { "name": "3 star", "count": 1000000 },
      { "name": "2 star", "count": 300000 },
      { "name": "1 star", "count": 150000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/PGjvC6vK/pngimg-com-discord-PNG8.png",
    "title": "Discord",
    "companyName": "Discord Inc.",
    "id": 18,
    "description": "Voice, video, and text chat. Discord is a communication platform designed for communities, gamers, and groups. Create servers and channels for organized discussions. Chat via text, voice, or video seamlessly. Share media, files, and links securely. Integrate bots to automate moderation and engagement. Participate in community events and streaming activities. Customize server settings, roles, and notifications. Accessible on mobile, desktop, and web for cross-platform connectivity.",
    "size": 40.0,
    "reviews": "18K",
    "ratingAvg": 4.5,
    "downloads": "250M",
    "ratings": [
      { "name": "5 star", "count": 8000000 },
      { "name": "4 star", "count": 4000000 },
      { "name": "3 star", "count": 900000 },
      { "name": "2 star", "count": 300000 },
      { "name": "1 star", "count": 150000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/4RTtyRvd/image.png",
    "title": "Kahoot!",
    "companyName": "Kahoot! AS",
    "id": 19,
    "description": "Game-based learning platform. Kahoot! allows teachers and students to create and play interactive quizzes. Engage participants with multiple-choice questions and polls. Track performance with detailed reports. Collaborate on learning through challenges and competitions. Integrate images, videos, and diagrams for engaging content. Use it in classrooms, remote learning, or team-building activities. Supports fun, interactive, and educational experiences for learners of all ages.",
    "size": 25.0,
    "reviews": "8K",
    "ratingAvg": 4.6,
    "downloads": "100M",
    "ratings": [
      { "name": "5 star", "count": 3000000 },
      { "name": "4 star", "count": 1500000 },
      { "name": "3 star", "count": 400000 },
      { "name": "2 star", "count": 100000 },
      { "name": "1 star", "count": 50000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/HfcsQ1P3/image.png",
    "title": "Figma",
    "companyName": "Figma, Inc.",
    "id": 20,
    "description": "Interface design & prototyping tool. Figma enables designers to create UI/UX designs collaboratively. Work in real-time with teammates and stakeholders. Build wireframes, prototypes, and design systems easily. Integrate with plugins for icons, charts, and animations. Share designs via links for instant feedback. Supports vector editing, responsive design, and component libraries. Accessible on browser and desktop apps. Ideal for designers, developers, and product teams worldwide.",
    "size": 30.0,
    "reviews": "10K",
    "ratingAvg": 4.7,
    "downloads": "50M",
    "ratings": [
      { "name": "5 star", "count": 4000000 },
      { "name": "4 star", "count": 2000000 },
      { "name": "3 star", "count": 500000 },
      { "name": "2 star", "count": 150000 },
      { "name": "1 star", "count": 100000 }
    ]
  }
]
